In [6]:
import selenium
from selenium import webdriver
from selenium.webdriver.chrome.service import Service
from selenium.webdriver.common.by import By
from selenium.webdriver.common.keys import Keys
import pandas as pd

In [7]:
s = Service("D:/New folder/chromedriver-win64/chromedriver-win64/chromedriver.exe")

# Sneakers

**Q4 First 100 sneaker from flipkart acraping Price,Product Description, and Brand**

In [3]:
driver = webdriver.Chrome(service = s)
driver.get("https://www.flipkart.com/")

In [4]:
enter = driver.find_element(By.XPATH,"/html/body/div[1]/div/div[1]/div/div/div/div/div[1]/div/div[1]/div/div[1]/div[1]/header/div[1]/div[2]/form/div/div/input")
enter.send_keys("sneakers")
enter.send_keys(Keys.ENTER)

In [6]:
Brand = []
count = 0
for page in range(0,3):
    count = count+1
    count1 = 0
    titles=driver.find_elements(By.XPATH,"//div[@class='syl9yP']") # first page jobtitles path
    for i in titles:
        Brand.append(i.text)
        count1 = count1+1
        if count ==3 and count1 == 20:
            break

In [7]:
price = []
count = 0
for page in range(0,3):
    count = count+1
    count1 = 0
    titles=driver.find_elements(By.XPATH,"//div[@class='_1sdMkc LFEi7Z']/div/a[2]/div[1]/div[1]") # first page jobtitles path
    for i in titles:
        price.append(i.text)
        count1 = count1+1
        if count ==3 and count1 == 20:
            break

In [8]:
Desc = []
count = 0
for page in range(0,3):
    count = count+1
    count1 = 0
    titles=driver.find_elements(By.XPATH,"//div[@class='_1sdMkc LFEi7Z']/div/a[1]") # first page jobtitles path
    for i in titles:
        Desc.append(i.text)
        count1 = count1+1
        if count ==3 and count1 == 20:
            break

In [9]:
Sneaker = pd.DataFrame({"Brand":Brand,"Price":price,"Description":Desc})
Sneaker

       Brand   Price                                        Description
0     BRUTON    ₹297                     Modern Trendy Sneakers For Men
1     BRUTON    ₹297                           Sneaker Sneakers For Men
2       PUMA  ₹1,047                         Cliff IDP Sneakers For Men
3       PUMA  ₹1,047                      Puma knit V3 Sneakers For Men
4       aadi    ₹299  Lightweight,Comfort,Summer,Trendy,Walking,Outd...
..       ...     ...                                                ...
95  Red Tape  ₹1,379  Sneaker Casual Shoes for Men | Soft Cushioned ...
96     Sparx    ₹721   SM 734 | Stylish, Comfortable | Sneakers For Men
97    BRUTON    ₹297      Modern Trendy Sneakers Shoes Sneakers For Men
98      PUMA  ₹1,047                     Puma Tychonic Sneakers For Men
99      ATOM  ₹1,685                         Supernova Sneakers For Men

[100 rows x 3 columns]

# Naukri

**Q1 Naukri  Data scientist with salary filter between 3-6 lakh and loaction filter Delhi NCR Scraping  Job loaction,Job title,
  Experience, Company name**

In [19]:
driver = webdriver.Chrome(service = s)
driver.get("https://www.naukri.com/")

In [20]:
# entering data scientist
skill = driver.find_element(By.XPATH,"/html/body/div[1]/div[7]/div/div/div[1]/div/div/div/div[1]/div/input")
skill.send_keys("“Data Scientist")
driver.find_element(By.XPATH,"/html/body/div[1]/div[7]/div/div/div[6]").click()

In [24]:
# location filter
loc = driver.find_element(By.XPATH,"//div[@class='styles_filter-wrapper-component__4OBpS']/div[3]/div[2]/div[3]")
loc.click()  # here there is multiple container of, every container of filter have same base name so
             # we are giving specific container number first
             # inside conatiner again i am repeating relative XPath

In [26]:
SAL = driver.find_element(By.XPATH,"//div[@class='styles_filterContainer__4aQaD'][2]/div[2]/div[2]")
SAL.click()

In [42]:
job_title = []
title = driver.find_elements(By.XPATH,"//div[@class='srp-jobtuple-wrapper']/div/div/a")
for i in title[0:10]:
    job_title.append(i.text)

In [40]:
job_location = []
location = driver.find_elements(By.XPATH,"//div[@class='srp-jobtuple-wrapper']/div/div[3]/div/span[3]/span/span")
for i in location[0:10]:
    job_location.append(i.text)

In [39]:
company_name = []
company = driver.find_elements(By.XPATH,"//div[@class='srp-jobtuple-wrapper']/div/div[2]/span/a[1]")
for i in company[0:10]:
    company_name.append(i.text)

In [41]:
exp= []
expe = driver.find_elements(By.XPATH,"//div[@class='srp-jobtuple-wrapper']/div/div[3]/div/span[1]/span[1]/span")
for i in expe[0:10]:
    exp.append(i.text)

In [43]:
c = pd.DataFrame({"Job_Title":job_title,"Job_Location":job_location,"Company_Name":company_name,"Experienec":exp})
c

,Job_Title,Job_Location,Company_Name,Experienec
0,Data Scientist,"Delhi / NCR, Pune, Bengaluru",Wipro,6-11 Yrs
1,Data Scientist III,Gurugram,Flutter,2-6 Yrs
2,Data Scientist,New Delhi,Sociomix,0-5 Yrs
3,Data scientist,Gurugram,Growthjockey,0-1 Yrs
4,Data Scientist,"Kolkata, Mumbai, New Delhi, Hyderabad, Pune, C...",Essenware,2-5 Yrs
5,Data Scientist (Telco),"Gurugram, Bengaluru",PayU,2-7 Yrs
6,Data Scientist,Gurugram,Orange Business Services,3-5 Yrs
7,Data Scientist,Noida,Ericsson,3-7 Yrs
8,Data Scientist,Noida,Times Internet,3-8 Yrs
9,Global GI Data Scientist,Faridabad,Hitachi Energy,3-5 Yrs

# Top 1000 quotes

**TOP 1000 quotes**

In [44]:
driver = webdriver.Chrome(service = s)
driver.get("https://www.azquotes.com/")

In [45]:
clicks = driver.find_element(By.XPATH,"/html/body/div[1]/div[1]/div[1]/div/div[3]/ul/li[5]/a")
clicks.click()

In [47]:
author = []
for page in range(0,10):
    titles=driver.find_elements(By.XPATH,"//div[@class='author']") # first page jobtitles path
    for i in titles:
        author.append(i.text)
    next_buttom=driver.find_element(By.XPATH,"/html/body/div[1]/div[2]/div/div/div/div[1]/div/div[4]/li[12]/a") # click button path
    next_buttom.click()

In [48]:
quotes = []
for page in range(0,10):
    titles=driver.find_elements(By.XPATH,"//div[@class='wrap-block']/p/a[2]") # first page jobtitles path
    for i in titles:
        quotes.append(i.text)
    next_buttom=driver.find_element(By.XPATH,"/html/body/div[1]/div[2]/div/div/div/div[1]/div/div[4]/li[12]/a") # click button path
    next_buttom.click()

In [49]:
type = []
for page in range(0,10):
    titles=driver.find_elements(By.XPATH,"//div[@class='tags']") # first page jobtitles path
    for i in titles:
        type.append(i.text)
    next_buttom=driver.find_element(By.XPATH,"/html/body/div[1]/div[2]/div/div/div/div[1]/div/div[4]/li[12]/a") # click button path
    next_buttom.click()

In [50]:
e = pd.DataFrame({"Author":author,"Type":type,"Quotes":quotes})
e

,Author,Type,Quotes
0,Michael Porter,"Inspirational, Life, Success",Courage is the price that life exacts for gran...
1,Golda Meir,"Peace, War, Government",The worst evils which mankind has ever had to ...
2,Theodore Roosevelt,"Life, Strength, Courage",The moment we begin to fear the opinions of ot...
3,Nelson Mandela,"Positive, Family, Trust","Trust yourself, you know more than you think y..."
4,Erma Bombeck,"Inspirational, Life, Motivational","Some people want it to happen, some wish it wo..."
...,...,...,...
995,Sydney J. Harris,"Love, Inspirational, Motivational",Regret for the things we did can be tempered b...
996,Hunter S. Thompson,"Gun, Two, Qualms About",America... just a nation of two hundred millio...
997,Jim Rohn,"Inspirational, Greatness, Best Effort",For every disciplined effort there is a multip...
998,Ram Dass,"Spiritual, Truth, Yoga","The spiritual journey is individual, highly pe..."
999,Plutarch,"Inspirational, Leadership, Education",The mind is not a vessel to be filled but a fi...

# **Shine**

- Write a python program to scrape data for “Data Scientist” Job position in “Bangalore” location. You have to scrape the
  job-title, job-location, company_name, experience_required. You have to scrape first 10 jobs data.

In [11]:
driver = webdriver.Chrome(service = s)
driver.get("https://www.shine.com/")

In [12]:
driver.find_element(By.XPATH,"/html/body/div/header/div[3]/div/div/div[1]/div/input").click()

In [13]:
enter1 = driver.find_element(By.XPATH,"/html/body/div/div[4]/div/div[2]/div[2]/div/form/div/div[1]/ul/li[1]/div/input")
enter1.send_keys("Data Scientist")
enter2 = driver.find_element(By.XPATH,"/html/body/div/div[4]/div/div[2]/div[2]/div/form/div/div[1]/ul/li[2]/div/input")
enter2.send_keys("Bangalore")

In [15]:
click1 = driver.find_element(By.XPATH,"/html/body/div/div[4]/div/div[2]/div[2]/div/form/div/div[2]/div/button")
click1.click()

**Job title**

In [16]:
job = []

In [18]:
job_title = driver.find_elements(By.XPATH,"//strong[@class='jobCard_pReplaceH2__xWmHg']")
for i in job_title[0:10]:
    job.append(i.text)

**Location**

In [28]:
loc = []

In [29]:
location = driver.find_elements(By.XPATH,"//div[@class='jobCard_jobCard_lists__fdnsc']/div[1]")
for i in location[0:10]:
    loc.append(i.text)

**company_name**

In [24]:
Company = []

In [25]:
companys =driver.find_elements(By.XPATH,"//div[@class='jobCard_jobCard_cName__mYnow']")
for i in companys[0:10]:
    Company.append(i.text)

**EXperience**

In [23]:
exp = []

In [26]:
expe = driver.find_elements(By.XPATH,"//div[@class=' jobCard_jobCard_lists_item__YxRkV jobCard_jobIcon__3FB1t']")
for i in expe[0:10]:
    exp.append(i.text)

In [30]:
Shine = pd.DataFrame({"Job_Title":job,"Location":loc,"Company_Name":Company,"Experience":exp})
Shine

,Job_Title,Location,Company_Name,Experience
0,Data Scientist,Bangalore,comosrich it & consulting services,3 to 8 Yrs
1,Data Scientist,Bangalore\n+1,dotcod innovation private limited,2 to 6 Yrs
2,Data Scientist Recruitment,Bangalore\n+13,kavya interprises,0 to 4 Yrs
3,Data Scientist,Bangalore,meraki it solutions,3 to 6 Yrs
4,Data Scientist,Bangalore\n+10,vaishnavi services,18 to >25 Yrs
5,Hiring For Data Scientist,Bangalore\n+15,neelima staffing solution,0 to 4 Yrs
6,Data Scientist,Bangalore\n+2,talent toppers llp,0 to 3 Yrs
7,Senior Associate Data Engineering Level 2,Bangalore\n+7,tlg india private limited,5 to 9 Yrs
8,Data Analyst,Bangalore\n+4,aryan technology,0 to 4 Yrs
9,Hr Data Analyst,Bangalore,leverage business solutions private...,4 to 8 Yrs

# IPHONE

As shown in the above page you have to scrape the tick marked attributes. These are:
1. Rating
2. Review summary
3. Full review
4. You have to scrape this data for first 100reviews.

In [1]:
import selenium
from selenium import webdriver
from selenium.webdriver.chrome.service import Service
from selenium.webdriver.common.by import By
from selenium.webdriver.common.keys import Keys
import pandas as pd

In [2]:
s = Service("D:/New folder/chromedriver-win64/chromedriver-win64/chromedriver.exe")

In [3]:
driver = webdriver.Chrome(service = s)
driver.get("https://www.flipkart.com/apple-iphone-11-black-64-gb/product-reviews/itm4e5041ba101fd?pid=MOBFWQ6BXGJCEYNY&lid=LSTMOBFWQ6BXGJCEYNYZXSHRJ&marketplace=FLIPKART")

In [4]:
Title = []
count = 0
for page in range(0,10):
    count = count+1
    count1 = 0
    titles=driver.find_elements(By.XPATH,"//p[@class='z9E0IG']") # first page jobtitles path
    for i in titles:
        Title.append(i.text)
        count1 = count1+1
        if count ==11 and count1 == 0:
            break

In [5]:
Summary = []
count = 0
for page in range(0,10):
    count = count+1
    count1 = 0
    titles=driver.find_elements(By.XPATH,"//div[@class='ZmyHeo']") # first page jobtitles path
    for i in titles:
        Summary.append(i.text)
        count1 = count1+1
        if count ==11 and count1 == 0:
            break

In [6]:
rate = []           

count = 0
for page in range(0,10):
    count = count+1  #//div[@class='XQDdHH Ga3i8K']
    count1 = 0
    titles=driver.find_elements(By.XPATH,"//div[@class='EKFha-']/div/div/div[1]/div[1]") # first page jobtitles path
    for i in titles:
        rate.append(i.text)
        count1 = count1+1
        if count ==11 and count1 == 0:
            break

In [9]:
IPhone = pd.DataFrame({"Review_Summary":Title,"Rating":rate,"Full_Review":Summary})
IPhone

,Review_Summary,Rating,Full_Review
0,Worth every penny,5,Feeling awesome after getting the delivery of ...
1,Best in the market!,5,Good Camera
2,Terrific,5,Very very good
3,Wonderful,5,This is amazing at all
4,Just wow!,5,Perfect Product!!
...,...,...,...
95,Perfect product!,5,Photos super
96,Classy product,5,Camera is awesome\nBest battery backup\nA perf...
97,Must buy!,5,It’s really awesome
98,Fabulous!,5,It’s very good battery life and display and vi...
99,Terrific purchase,5,Value for money 😍

# Amazon  laptop

In [3]:
driver = webdriver.Chrome(service = s)
driver.get("https://www.amazon.in/")

In [12]:
search = driver.find_element(By.XPATH,"/html/body/div[1]/header/div/div[1]/div[2]/div/form/div[2]/div[1]/input")
search.send_keys("Laptop")
search.send_keys(Keys.ENTER)

In [13]:
clicks = driver.find_element(By.XPATH,"/html/body/div[1]/header/div/div[1]/div[2]/div/form/div[3]/div/span/input")
clicks.click()

In [14]:
filters = driver.find_element(By.XPATH,"/html/body/div[1]/div[1]/div[1]/div[2]/div/div[3]/span/div[1]/div/div/div[6]/ul[2]/span/span[10]/li/span/a/span")
filters.click()

In [16]:
title = []
title_name = driver.find_elements(By.XPATH,"//span[@class='a-size-medium a-color-base a-text-normal']")
for i in title_name[0:10]:
    title.append(i.text)

In [15]:
price = []
prices = driver.find_elements(By.XPATH,"//div[@class='a-row a-size-base a-color-base']/div[1]/a/span/span[2]/span[2]")
for i in prices[0:10]:
    price.append(i.text)

In [ ]:
# Having problem in scraping rating column

In [17]:
Amazon = pd.DataFrame({"Title":title,"Price":price})
Amazon

                                               Title   Price
0  MSI Modern 14, Intel 12th Gen. i7-1255U, 36CM ...  47,990
1  HP Laptop 15s, 12th Gen Intel Core i7-1255U, 1...  65,490
2  Lenovo IdeaPad 3 Intel Core i7 12th Gen 1255U ...  62,009
3  ASUS Vivobook 15, Intel Core i7-12650H 12th Ge...  64,990
4  Lenovo IdeaPad Slim 5 Intel Core i7 13700H 16"...  84,190
5  HP Pavilion 14 12th Gen Intel Core i7 16GB SDR...  78,850
6  Dell [Smartchoice Inspiron 5430 Thin & Light L...  80,490
7  HP Pavilion 14, 11th Gen Intel Core i7-1195G7,...  66,990
8  Dell Latitude 7480 14in FHD Laptop PC - Intel ...  69,990
9  Dell Inspiron 3530 Laptop, 13th Generation Int...  83,990

In [18]:
rate = [] # NOt anle to scrap
rate1 = driver.find_elements(By.XPATH,"//a[@class='a-popover-trigger a-declarative']/i[1]/span")
for i in rate1[0:10]:
    rate.append(i.text)

In [20]:
c = pd.DataFrame({"Rate":rate})
c

  Rate
0
1
2
3
4
5
6
7
8
9